{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: SPARQLWrapper in c:\\users\\foglo\\anaconda3\\envs\\energy-graph\\lib\\site-packages (2.0.0)\n",
      "Requirement already satisfied: rdflib>=6.1.1 in c:\\users\\foglo\\anaconda3\\envs\\energy-graph\\lib\\site-packages (from SPARQLWrapper) (7.0.0)\n",
      "Requirement already satisfied: isodate<0.7.0,>=0.6.0 in c:\\users\\foglo\\anaconda3\\envs\\energy-graph\\lib\\site-packages (from rdflib>=6.1.1->SPARQLWrapper) (0.6.1)\n",
      "Requirement already satisfied: pyparsing<4,>=2.1.0 in c:\\users\\foglo\\anaconda3\\envs\\energy-graph\\lib\\site-packages (from rdflib>=6.1.1->SPARQLWrapper) (3.0.9)\n",
      "Requirement already satisfied: six in c:\\users\\foglo\\anaconda3\\envs\\energy-graph\\lib\\site-packages (from isodate<0.7.0,>=0.6.0->rdflib>=6.1.1->SPARQLWrapper) (1.16.0)\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: fuzzywuzzy in c:\\users\\foglo\\anaconda3\\envs\\energy-graph\\lib\\site-packages (0.18.0)\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: geopy in c:\\users\\foglo\\anaconda3\\envs\\energy-graph\\lib\\site-packages (2.4.0)\n",
      "Requirement already satisfied: geographiclib<3,>=1.52 in c:\\users\\foglo\\anaconda3\\envs\\energy-graph\\lib\\site-packages (from geopy) (2.0)\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "c:\\Users\\foglo\\anaconda3\\envs\\energy-graph\\Lib\\site-packages\\fuzzywuzzy\\fuzz.py:11: UserWarning: Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning\n",
      "  warnings.warn('Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning')\n"
     ]
    }
   ],
   "source": [
    "%pip install SPARQLWrapper\n",
    "%pip install fuzzywuzzy\n",
    "%pip install geopy\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "from fuzzywuzzy import fuzz\n",
    "from geopy.distance import geodesic\n",
    "import math"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def query_wikidata_coordinates(latitude : float, longitude : float, label : str, data=None):\n",
    "    if data is None:\n",
    "        print(\"Querying Wikidata......\")\n",
    "        query_wikidata = f\"\"\"\n",
    "        PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "        PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX bd: <http://www.bigdata.com/rdf#>\n",
    "        PREFIX wikibase: <http://wikiba.se/ontology#>\n",
    "        PREFIX geo: <http://www.opengis.net/ont/geosparql#>\n",
    "\n",
    "        SELECT DISTINCT ?city ?cityLabel ?location\n",
    "        WHERE {{\n",
    "        SERVICE wikibase:around {{\n",
    "            ?city wdt:P625 ?location .\n",
    "            bd:serviceParam wikibase:center \"Point({longitude} {latitude})\"^^geo:wktLiteral .\n",
    "            bd:serviceParam wikibase:radius \"50\" . \n",
    "        }}\n",
    "        ?city wdt:P31/wdt:P279* wd:Q515 . \n",
    "        ?city rdfs:label ?cityLabel .\n",
    "        FILTER(LANG(?cityLabel) = \"en\") .\n",
    "        \n",
    "        }} LIMIT 1000\n",
    "    \n",
    "        \"\"\"\n",
    "        sparql_wdata = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "\n",
    "        sparql_wdata.setQuery(query_wikidata)\n",
    "\n",
    "        sparql_wdata.setReturnFormat(JSON)\n",
    "\n",
    "        results = sparql_wdata.query().convert()\n",
    "    else:\n",
    "        results = data\n",
    "\n",
    "        \n",
    "    matched_cities = []\n",
    "    \n",
    "    for r in results[\"results\"][\"bindings\"]:\n",
    "        ratio_partial = fuzz.partial_ratio(r[\"cityLabel\"][\"value\"], label)\n",
    "        ratio = fuzz.ratio(r[\"cityLabel\"][\"value\"], label)\n",
    "\n",
    "        ratio = (ratio + ratio_partial) / 2\n",
    "        if ratio > 80:\n",
    "            matched_cities.append((ratio, r))\n",
    "\n",
    "    if len(matched_cities) == 0:\n",
    "        min_distance = math.inf\n",
    "        for r in results[\"results\"][\"bindings\"]:\n",
    "            coords = r[\"location\"][\"value\"].split(\"(\")[1].split(\")\")[0].split(\" \")\n",
    "            coords = (float(coords[1]), float(coords[0]))\n",
    "            distance = geodesic((latitude, longitude), coords).kilometers\n",
    "            if distance < min_distance:\n",
    "                min_distance = distance\n",
    "                closest_city = r\n",
    "        return closest_city\n",
    "    \n",
    "    matched_cities.sort(key=lambda x: x[0], reverse=True)\n",
    "    return matched_cities[0][1]\n",
    "\n",
    "def get_wikidata_results(latitude : float, longitude : float):\n",
    "    query_wikidata = f\"\"\"\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX bd: <http://www.bigdata.com/rdf#>\n",
    "    PREFIX wikibase: <http://wikiba.se/ontology#>\n",
    "    PREFIX geo: <http://www.opengis.net/ont/geosparql#>\n",
    "\n",
    "    SELECT DISTINCT ?city ?cityLabel ?location\n",
    "    WHERE {{\n",
    "    SERVICE wikibase:around {{\n",
    "        ?city wdt:P625 ?location .\n",
    "        bd:serviceParam wikibase:center \"Point({longitude} {latitude})\"^^geo:wktLiteral .\n",
    "        bd:serviceParam wikibase:radius \"50\" . \n",
    "    }}\n",
    "    ?city wdt:P31/wdt:P279* wd:Q515 . \n",
    "    ?city rdfs:label ?cityLabel .\n",
    "    FILTER(LANG(?cityLabel) = \"en\") .\n",
    "\n",
    "    }} LIMIT 1000\n",
    "\n",
    "    \"\"\"\n",
    "     \n",
    "    sparql_wdata = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "\n",
    "    sparql_wdata.setQuery(query_wikidata)\n",
    "\n",
    "    sparql_wdata.setReturnFormat(JSON)\n",
    "\n",
    "    results = sparql_wdata.query().convert()\n",
    "    return results\n",
    "\n",
    "def get_dbpedia_results(latitude : float, longitude : float):\n",
    "    query = f\"\"\"\n",
    "    PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "    PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "\n",
    "    SELECT DISTINCT ?city ?cityLabel \n",
    "    WHERE {{\n",
    "      ?city a dbo:City .\n",
    "      ?city rdfs:label ?cityLabel .\n",
    "      ?city geo:lat ?lat .\n",
    "      ?city geo:long ?long .\n",
    "      FILTER (LANG(?cityLabel) = \"en\")\n",
    "      FILTER (\n",
    "        bif:st_intersects (\n",
    "          bif:st_point (?long, ?lat),\n",
    "          bif:st_point ({longitude}, {latitude}),\n",
    "          50\n",
    "        )\n",
    "      )\n",
    "    }}\n",
    "    LIMIT 1000\n",
    "\n",
    "\n",
    "    \"\"\"\n",
    "\n",
    "    sparql_dbpedia = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "\n",
    "    sparql_dbpedia.setQuery(query)\n",
    "\n",
    "    sparql_dbpedia.setReturnFormat(JSON)\n",
    "\n",
    "    results = sparql_dbpedia.query().convert()\n",
    "\n",
    "    return results\n",
    "\n",
    "def query_dbpedia_coordinates(latitude : float, longitude : float, label : str, data=None):\n",
    "    if data is None:\n",
    "        print(\"Querying DBpedia......\")\n",
    "        query = f\"\"\"\n",
    "        PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "        PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "        PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "\n",
    "        SELECT DISTINCT ?city ?cityLabel ?lat ?long\n",
    "        WHERE {{\n",
    "          ?city a dbo:City .\n",
    "          ?city rdfs:label ?cityLabel .\n",
    "          ?city geo:lat ?lat .\n",
    "          ?city geo:long ?long .\n",
    "          FILTER (LANG(?cityLabel) = \"en\")\n",
    "          FILTER (\n",
    "            bif:st_intersects (\n",
    "              bif:st_point (?long, ?lat),\n",
    "              bif:st_point ({longitude}, {latitude}),\n",
    "              50\n",
    "            )\n",
    "          )\n",
    "        }}\n",
    "        LIMIT 1000\n",
    "\n",
    "\n",
    "        \"\"\"\n",
    "\n",
    "        sparql_dbpedia = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "\n",
    "        sparql_dbpedia.setQuery(query)\n",
    "\n",
    "        sparql_dbpedia.setReturnFormat(JSON)\n",
    "\n",
    "        results = sparql_dbpedia.query().convert()\n",
    "    else:\n",
    "        results = data\n",
    "\n",
    "    matched_cities = []\n",
    "    \n",
    "    for r in results[\"results\"][\"bindings\"]:\n",
    "        ratio_partial = fuzz.partial_ratio(r[\"cityLabel\"][\"value\"], label)\n",
    "        ratio = fuzz.ratio(r[\"cityLabel\"][\"value\"], label)\n",
    "\n",
    "        ratio = (ratio + ratio_partial) / 2\n",
    "\n",
    "        if ratio > 80:\n",
    "            matched_cities.append((ratio, r))\n",
    "\n",
    "    if len(matched_cities) == 0:\n",
    "        min_distance = math.inf\n",
    "        for r in results[\"results\"][\"bindings\"]:\n",
    "            coords = (float(r[\"lat\"][\"value\"]), float(r[\"long\"][\"value\"]))\n",
    "            distance = geodesic((latitude, longitude), coords).kilometers\n",
    "            if distance < min_distance:\n",
    "                min_distance = distance\n",
    "                closest_city = r\n",
    "\n",
    "        return closest_city\n",
    "    \n",
    "    matched_cities.sort(key=lambda x: x[0], reverse=True)\n",
    "    return matched_cities[0][1]\n",
    "\n",
    "\n",
    "def query_graphDB():\n",
    "    query_my_data = \"\"\"\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX wdtn: <http://www.wikidata.org/prop/direct-normalized/>\n",
    "    PREFIX data: <http://mydata.example.org/>\n",
    "    PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX voc: <http://vocabulary.example.org/>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    SELECT DISTINCT ?cityName ?longitude ?latitude ?City\n",
    "    WHERE {\n",
    "    ?s rdf:type schema:Place .\n",
    "    ?s schema:containedInPlace ?City .\n",
    "    ?City rdf:type schema:City .\n",
    "    ?City schema:name ?cityName .\n",
    "    ?s schema:longitude ?longitude .\n",
    "    ?s schema:latitude ?latitude . \n",
    "    }\n",
    "    \"\"\"\n",
    "    # endpoint = \"http://localhost:7200/repositories/test\"\n",
    "    endpoint = \"http://193.2.205.14:7200/repositories/EnergyGraph\"\n",
    "\n",
    "    sparlq_graphdb = SPARQLWrapper(endpoint)\n",
    "    sparlq_graphdb.setQuery(query_my_data)\n",
    "    sparlq_graphdb.setReturnFormat(JSON)\n",
    "    results_Graphdb = sparlq_graphdb.query().convert()\n",
    "\n",
    "    return results_Graphdb    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [],
   "source": [
    "def query_graphdb_countries():\n",
    "    query_countries = \"\"\"\n",
    "    PREFIX voc: <http://vocabulary.example.org/>\n",
    "    PREFIX saref: <https://saref.etsi.org/core/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    SELECT DISTINCT ?country WHERE {\n",
    "    ?country rdf:type schema:Country . \n",
    "    \n",
    "    }\n",
    "    \"\"\"\n",
    "    sparql_graphdb = SPARQLWrapper(\"http://193.2.205.14:7200/repositories/EnergyGraph_mixed\")\n",
    "    sparql_graphdb.setQuery(query_countries)\n",
    "    sparql_graphdb.setReturnFormat(JSON)\n",
    "\n",
    "    results = sparql_graphdb.query().convert()\n",
    "    uris = {}\n",
    "    for uri in results[\"results\"][\"bindings\"]:\n",
    "        k =  uri[\"country\"][\"value\"].split(\"/\")[-1].replace(\"%20\", \" \")\n",
    "        uris[k] = uri[\"country\"][\"value\"]\n",
    "    return uris\n",
    "\n",
    "\n",
    "\n",
    "def query_dbpedia_countries(country : str):\n",
    "    query = f\"\"\"\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "    PREFIX dbp: <http://dbpedia.org/property/>\n",
    "\n",
    "    SELECT ?country WHERE {{\n",
    "    ?country a dbo:Country ;\n",
    "            rdfs:label \"{country}\"@en .\n",
    "    }}\n",
    "    LIMIT 1\n",
    "    \"\"\"\n",
    "    sparql_dbpedia = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "    sparql_dbpedia.setQuery(query)\n",
    "    sparql_dbpedia.setReturnFormat(JSON)\n",
    "    results = sparql_dbpedia.query().convert()\n",
    "    return results[\"results\"][\"bindings\"][0][\"country\"][\"value\"]\n",
    "\n",
    "res = query_dbpedia_countries(\"Canada\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'http://dbpedia.org/resource/Canada'"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Canada\n",
      "United Kingdom\n",
      "South Korea\n",
      "Switzerland\n",
      "India\n",
      "Germany\n",
      "Greece\n",
      "Netherlands\n",
      "Poland\n",
      "Portugal\n",
      "France\n",
      "United States of America\n",
      "Uruguay\n"
     ]
    }
   ],
   "source": [
    "\n",
    "def query_graphDB_cities(endpoint : str):\n",
    "    \"\"\"Query the energy knowledge graph for the cities and their coordinates\"\"\"\n",
    "    query_my_data = \"\"\"\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX wdtn: <http://www.wikidata.org/prop/direct-normalized/>\n",
    "    PREFIX data: <http://mydata.example.org/>\n",
    "    PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX voc: <http://vocabulary.example.org/>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    SELECT DISTINCT ?cityName ?longitude ?latitude ?City\n",
    "    WHERE {\n",
    "    ?s rdf:type schema:Place .\n",
    "    ?s schema:containedInPlace ?City .\n",
    "    ?City rdf:type schema:City .\n",
    "    ?City schema:name ?cityName .\n",
    "    ?s schema:longitude ?longitude .\n",
    "    ?s schema:latitude ?latitude . \n",
    "    }\n",
    "    \"\"\"\n",
    "    # endpoint = \"http://localhost:7200/repositories/test\"\n",
    "\n",
    "    sparlq_graphdb = SPARQLWrapper(endpoint)\n",
    "    sparlq_graphdb.setQuery(query_my_data)\n",
    "    sparlq_graphdb.setReturnFormat(JSON)\n",
    "    results_Graphdb = sparlq_graphdb.query().convert()\n",
    "\n",
    "    for r in results_Graphdb[\"results\"][\"bindings\"]:\n",
    "        print(r[\"cityName\"][\"value\"], r[\"longitude\"][\"value\"], r[\"latitude\"][\"value\"])\n",
    "\n",
    "    return results_Graphdb \n",
    "\n",
    "# query_graphDB_cities(\"http://193.2.205.14:7200/repositories/EnergyGraph_mixed\")\n",
    "\n",
    "def query_wikidata_countries(country: str):\n",
    "    \"\"\"\n",
    "    Query Wikidata for the country of a city given its city wikidata entity id\n",
    "    \"\"\"   \n",
    "    # query_wikidata_countries =f\"\"\"PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    # PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    # PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    # PREFIX bd: <http://www.bigdata.com/rdf#>\n",
    "\n",
    "    # SELECT ?city ?cityLabel ?country ?countryLabel\n",
    "    # WHERE {{\n",
    "    # wd:{city} rdfs:label ?cityLabel ;  # City (Montreal)\n",
    "    #         wdt:P17 ?country .         # Country of the city\n",
    "    # ?country rdfs:label ?countryLabel .\n",
    "    \n",
    "    # FILTER(LANG(?cityLabel) = \"en\" && LANG(?countryLabel) = \"en\").\n",
    "    # }}\n",
    "    # \"\"\"\n",
    "    query_wikidata_countries = f\"\"\"\n",
    "    SELECT ?country WHERE {{\n",
    "    ?country wdt:P31 wd:Q6256; # instance of a country\n",
    "            rdfs:label \"{country}\"@en. # country name in English\n",
    "    }}\n",
    "\n",
    "    \"\"\"\n",
    "        \n",
    "    sparql_wdata = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "\n",
    "    sparql_wdata.setQuery(query_wikidata_countries)\n",
    "\n",
    "    sparql_wdata.setReturnFormat(JSON)\n",
    "\n",
    "    results = sparql_wdata.query().convert()\n",
    "    \n",
    "    return results[\"results\"][\"bindings\"][0][\"country\"][\"value\"]\n",
    "    \n",
    "\n",
    "def query_graphdb_countries():\n",
    "    query_countries = \"\"\"\n",
    "    PREFIX voc: <http://vocabulary.example.org/>\n",
    "    PREFIX saref: <https://saref.etsi.org/core/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    SELECT DISTINCT ?country WHERE {\n",
    "    ?country rdf:type schema:Country . \n",
    "    \n",
    "    }\n",
    "    \"\"\"\n",
    "    sparql_graphdb = SPARQLWrapper(\"http://193.2.205.14:7200/repositories/EnergyGraph_mixed\")\n",
    "    sparql_graphdb.setQuery(query_countries)\n",
    "    sparql_graphdb.setReturnFormat(JSON)\n",
    "\n",
    "    results = sparql_graphdb.query().convert()\n",
    "    uris = {}\n",
    "    for uri in results[\"results\"][\"bindings\"]:\n",
    "        k =  uri[\"country\"][\"value\"].split(\"/\")[-1].replace(\"%20\", \" \")\n",
    "        # special case for the US\n",
    "        if k == \"United States\":\n",
    "            k = \"United States of America\"\n",
    "        uris[k] = uri[\"country\"][\"value\"]\n",
    "    return uris\n",
    "\n",
    "\n",
    "\n",
    "matches = []\n",
    "# query_wikidata_countries(\"Canada\")\n",
    "result_Graphdb_countries = query_graphdb_countries()\n",
    "for c in result_Graphdb_countries:\n",
    "        print(c)\n",
    "        result_wikidata = (result_Graphdb_countries[c], query_wikidata_countries(c))\n",
    "        matches.append(result_wikidata)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('http://mydata.example.org/public-locations-country/Canada',\n",
       "  'http://www.wikidata.org/entity/Q16'),\n",
       " ('http://mydata.example.org/public-locations-country/United%20Kingdom',\n",
       "  'http://www.wikidata.org/entity/Q145'),\n",
       " ('http://mydata.example.org/public-locations-country/South%20Korea',\n",
       "  'http://www.wikidata.org/entity/Q884'),\n",
       " ('http://mydata.example.org/public-locations-country/Switzerland',\n",
       "  'http://www.wikidata.org/entity/Q39'),\n",
       " ('http://mydata.example.org/public-locations-country/India',\n",
       "  'http://www.wikidata.org/entity/Q668'),\n",
       " ('http://mydata.example.org/public-locations-country/Germany',\n",
       "  'http://www.wikidata.org/entity/Q183'),\n",
       " ('http://mydata.example.org/public-locations-country/Greece',\n",
       "  'http://www.wikidata.org/entity/Q41'),\n",
       " ('http://mydata.example.org/public-locations-country/Netherlands',\n",
       "  'http://www.wikidata.org/entity/Q55'),\n",
       " ('http://mydata.example.org/public-locations-country/Poland',\n",
       "  'http://www.wikidata.org/entity/Q36'),\n",
       " ('http://mydata.example.org/public-locations-country/Portugal',\n",
       "  'http://www.wikidata.org/entity/Q45'),\n",
       " ('http://mydata.example.org/public-locations-country/France',\n",
       "  'http://www.wikidata.org/entity/Q142'),\n",
       " ('http://mydata.example.org/public-locations-country/United%20States',\n",
       "  'http://www.wikidata.org/entity/Q30'),\n",
       " ('http://mydata.example.org/public-locations-country/Uruguay',\n",
       "  'http://www.wikidata.org/entity/Q77')]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "matches"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "results = query_graphDB()\n",
    "data = {}\n",
    "matches= []\n",
    "for c in results[\"results\"][\"bindings\"]:\n",
    "    label = c[\"cityName\"][\"value\"]\n",
    "    longitude = float(c[\"longitude\"][\"value\"])\n",
    "    latitude = float(c[\"latitude\"][\"value\"])\n",
    "    data[label] = get_wikidata_results(latitude, longitude)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['cityName', 'longitude', 'latitude', 'City']},\n",
       " 'results': {'bindings': [{'cityName': {'type': 'literal',\n",
       "     'value': 'City of Edinburgh'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-3.1883E0'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '5.59533E1'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/City%20of%20Edinburgh'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'City of Edinburgh'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-3.1883E0'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '5.59533E1'},\n",
       "    'City': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q23436'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'City of Edinburgh'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-3.1883E0'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '5.59533E1'},\n",
       "    'City': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Edinburgh'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'London'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-7.6544E-2'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '5.1464462E1'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/London'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'London'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-7.6544E-2'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '5.1464462E1'},\n",
       "    'City': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q84'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'London'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-7.6544E-2'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '5.1464462E1'},\n",
       "    'City': {'type': 'uri', 'value': 'http://dbpedia.org/resource/London'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Boston'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-7.1064709E1'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '4.2360338E1'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/Boston'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Boston'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-7.1064709E1'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '4.2360338E1'},\n",
       "    'City': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q100'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Boston'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-7.1064709E1'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '4.2360338E1'},\n",
       "    'City': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Boston'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Montreal'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-7.3561668E1'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '4.5508888E1'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/Montreal'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Montreal'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-7.3561668E1'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '4.5508888E1'},\n",
       "    'City': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q340'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Montreal'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-7.3561668E1'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '4.5508888E1'},\n",
       "    'City': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Montreal'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Abbotsford'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-1.2235E2'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '4.9083333E1'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/Abbotsford'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Abbotsford'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-1.2235E2'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '4.9083333E1'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q271730'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Abbotsford'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-1.2235E2'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '4.9083333E1'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Abbotsford,_British_Columbia'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Charnwood'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-1.2097E0'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '5.27709E1'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/Charnwood'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Charnwood'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-1.2097E0'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '5.27709E1'},\n",
       "    'City': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q83065'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Charnwood'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '-1.2097E0'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'type': 'literal',\n",
       "     'value': '5.27709E1'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Loughborough'}}]}}"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = query_graphDB()\n",
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "def query_wikidata_countries(country: str):\n",
    "    \"\"\"\n",
    "    Query Wikidata for the country of a city given its city wikidata entity id\n",
    "    \"\"\"   \n",
    "    # query_wikidata_countries =f\"\"\"PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    # PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    # PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    # PREFIX bd: <http://www.bigdata.com/rdf#>\n",
    "\n",
    "    # SELECT ?city ?cityLabel ?country ?countryLabel\n",
    "    # WHERE {{\n",
    "    # wd:{city} rdfs:label ?cityLabel ;  # City (Montreal)\n",
    "    #         wdt:P17 ?country .         # Country of the city\n",
    "    # ?country rdfs:label ?countryLabel .\n",
    "    \n",
    "    # FILTER(LANG(?cityLabel) = \"en\" && LANG(?countryLabel) = \"en\").\n",
    "    # }}\n",
    "    # \"\"\"\n",
    "    query_wikidata_countries = f\"\"\"\n",
    "    SELECT ?country WHERE {{\n",
    "    ?country wdt:P31 wd:Q6256; # instance of a country\n",
    "            rdfs:label \"{country}\"@en. # country name in English\n",
    "    }}\n",
    "\n",
    "    \"\"\"\n",
    "        \n",
    "    sparql_wdata = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "\n",
    "    sparql_wdata.setQuery(query_wikidata_countries)\n",
    "\n",
    "    sparql_wdata.setReturnFormat(JSON)\n",
    "\n",
    "    results = sparql_wdata.query().convert()\n",
    "\n",
    "    return results[\"results\"][\"bindings\"][0][\"country\"][\"value\"]\n",
    "results = query_wikidata_countries(\"Canada\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['cityName', 'longitude', 'latitude', 'City']},\n",
       " 'results': {'bindings': [{'cityName': {'type': 'literal',\n",
       "     'value': 'Montevideo'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-56.16453170776367'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-34.9011116027832'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/Montevideo'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Montevideo'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-56.16453170776367'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-34.9011116027832'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Montevideo'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Montevideo'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-56.16453170776367'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-34.9011116027832'},\n",
       "    'City': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1335'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'London'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-0.07654400169849396'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '51.46446228027344'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/London'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'London'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-0.07654400169849396'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '51.46446228027344'},\n",
       "    'City': {'type': 'uri', 'value': 'http://dbpedia.org/resource/London'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'London'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-0.07654400169849396'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '51.46446228027344'},\n",
       "    'City': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q84'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'City of Edinburgh'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-3.1882998943328857'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '55.95330047607422'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/City%20of%20Edinburgh'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'City of Edinburgh'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-3.1882998943328857'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '55.95330047607422'},\n",
       "    'City': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Edinburgh'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'City of Edinburgh'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-3.1882998943328857'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '55.95330047607422'},\n",
       "    'City': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q23436'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Boston'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-71.06471252441406'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '42.36033630371094'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/Boston'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Boston'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-71.06471252441406'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '42.36033630371094'},\n",
       "    'City': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Boston'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Boston'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-71.06471252441406'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '42.36033630371094'},\n",
       "    'City': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q100'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Montreal'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-73.5616683959961'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '45.508888244628906'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/Montreal'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Montreal'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-73.5616683959961'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '45.508888244628906'},\n",
       "    'City': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Montreal'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Montreal'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-73.5616683959961'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '45.508888244628906'},\n",
       "    'City': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q340'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Abbotsford'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-122.3499984741211'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '49.08333206176758'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/Abbotsford'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Abbotsford'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-122.3499984741211'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '49.08333206176758'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Abbotsford,_British_Columbia'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Abbotsford'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-122.3499984741211'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '49.08333206176758'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q271730'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Charnwood'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-1.2096999883651733'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '52.77090072631836'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://mydata.example.org/public-locations-City/Charnwood'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Charnwood'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-1.2096999883651733'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '52.77090072631836'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Loughborough'}},\n",
       "   {'cityName': {'type': 'literal', 'value': 'Charnwood'},\n",
       "    'longitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '-1.2096999883651733'},\n",
       "    'latitude': {'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'type': 'literal',\n",
       "     'value': '52.77090072631836'},\n",
       "    'City': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q17645993'}}]}}"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def query_graphDB_cities(endpoint : str):\n",
    "    \"\"\"Query the energy knowledge graph for the cities and their coordinates\"\"\"\n",
    "    query_my_data = \"\"\"\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX wdtn: <http://www.wikidata.org/prop/direct-normalized/>\n",
    "    PREFIX data: <http://mydata.example.org/>\n",
    "    PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX voc: <http://vocabulary.example.org/>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    SELECT DISTINCT ?cityName ?longitude ?latitude ?City\n",
    "    WHERE {\n",
    "    ?s rdf:type schema:Place .\n",
    "    ?s schema:containedInPlace ?City .\n",
    "    ?City rdf:type schema:City .\n",
    "    ?City schema:name ?cityName .\n",
    "    ?s schema:longitude ?longitude .\n",
    "    ?s schema:latitude ?latitude . \n",
    "    }\n",
    "    \"\"\"\n",
    "    # endpoint = \"http://localhost:7200/repositories/test\"\n",
    "\n",
    "    sparlq_graphdb = SPARQLWrapper(endpoint)\n",
    "    sparlq_graphdb.setQuery(query_my_data)\n",
    "    sparlq_graphdb.setReturnFormat(JSON)\n",
    "    results_Graphdb = sparlq_graphdb.query().convert()\n",
    "\n",
    "    for c in results_Graphdb[\"results\"][\"bindings\"]:\n",
    "        label = c[\"cityName\"][\"value\"]\n",
    "        longitude = float(c[\"longitude\"][\"value\"])\n",
    "        latitude = float(c[\"latitude\"][\"value\"])\n",
    "        data[label] = get_wikidata_results(latitude, longitude)\n",
    "\n",
    "    return results_Graphdb \n",
    "\n",
    "query_graphDB_cities(\"http://193.2.205.14:7200/repositories/EnergyGraph_mixed\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Querying Wikidata......\n"
     ]
    }
   ],
   "source": [
    "def query_wikidata_coordinates(latitude : float, longitude : float, label : str, data=None):\n",
    "    \"\"\"\n",
    "    Query Wikidata for the coordinates of a city given its label and coordinates, if the label is not found, return the closest city\n",
    "    Can be used with the results of a previous query to avoid querying Wikidata again by passing the results as the data parameter\n",
    "    \"\"\"\n",
    "    if data is None:\n",
    "        print(\"Querying Wikidata......\")\n",
    "        results = get_wikidata_results(latitude, longitude)\n",
    "    else:\n",
    "        results = data\n",
    "\n",
    "        \n",
    "    matched_cities = []\n",
    "    # match the label of the city with the results and if the similarity is above 80% add it to the list of matches\n",
    "    for r in results[\"results\"][\"bindings\"]:\n",
    "        ratio = fuzz.partial_ratio(r[\"cityLabel\"][\"value\"], label)\n",
    "        if ratio > 80:\n",
    "            matched_cities.append((ratio, r))\n",
    "\n",
    "    # if no match is found, return the closest city\n",
    "    if len(matched_cities) == 0:\n",
    "        min_distance = math.inf\n",
    "        for r in results[\"results\"][\"bindings\"]:\n",
    "            coords = r[\"location\"][\"value\"].split(\"(\")[1].split(\")\")[0].split(\" \")\n",
    "            coords = (float(coords[1]), float(coords[0]))\n",
    "            distance = geodesic((latitude, longitude), coords).kilometers\n",
    "            if distance < min_distance:\n",
    "                min_distance = distance\n",
    "                closest_city = r\n",
    "        return closest_city\n",
    "    # sort the results by the ratio of the match and return the best match\n",
    "    matched_cities.sort(key=lambda x: x[0], reverse=True)\n",
    "    return matched_cities[0][1]\n",
    "\n",
    "\n",
    "\n",
    "def get_wikidata_results(latitude : float, longitude : float):\n",
    "\n",
    "    # wiki data query to get the cities in a 50km radius of the given coordinates\n",
    "    query_wikidata = f\"\"\"\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX bd: <http://www.bigdata.com/rdf#>\n",
    "    PREFIX wikibase: <http://wikiba.se/ontology#>\n",
    "    PREFIX geo: <http://www.opengis.net/ont/geosparql#>\n",
    "\n",
    "    SELECT DISTINCT ?city ?cityLabel ?location\n",
    "    WHERE {{\n",
    "    SERVICE wikibase:around {{\n",
    "        ?city wdt:P625 ?location .\n",
    "        bd:serviceParam wikibase:center \"Point({longitude} {latitude})\"^^geo:wktLiteral .\n",
    "        bd:serviceParam wikibase:radius \"50\" . \n",
    "    }}\n",
    "    ?city wdt:P31/wdt:P279* wd:Q515 . \n",
    "    ?city rdfs:label ?cityLabel .\n",
    "    FILTER(LANG(?cityLabel) = \"en\") .\n",
    "\n",
    "    }} LIMIT 1000\n",
    "\n",
    "    \"\"\"\n",
    "     \n",
    "    sparql_wdata = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "\n",
    "    sparql_wdata.setQuery(query_wikidata)\n",
    "\n",
    "    sparql_wdata.setReturnFormat(JSON)\n",
    "\n",
    "    results = sparql_wdata.query().convert()\n",
    "    return results\n",
    "\n",
    "res =query_wikidata_coordinates(45.508888, -73.561668, \"Montreal\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'http://www.wikidata.org/entity/Q340'"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res[\"city\"][\"value\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "London -0.07654400169849396 51.46446228027344\n",
      "Querying Wikidata......\n",
      "http://www.wikidata.org/entity/Q145\n"
     ]
    }
   ],
   "source": [
    "def query_wikidata_countries(city: str):\n",
    "    \"\"\"\n",
    "    Query Wikidata for the country of a city given its city wikidata entity id\n",
    "    \"\"\"\n",
    "    city = city[\"city\"][\"value\"].split(\"/\")[-1]\n",
    "   \n",
    "    query_wikidata_countries =f\"\"\"PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX bd: <http://www.bigdata.com/rdf#>\n",
    "\n",
    "    SELECT ?city ?cityLabel ?country ?countryLabel\n",
    "    WHERE {{\n",
    "    wd:{city} rdfs:label ?cityLabel ;  # City (Montreal)\n",
    "            wdt:P17 ?country .         # Country of the city\n",
    "    ?country rdfs:label ?countryLabel .\n",
    "    \n",
    "    FILTER(LANG(?cityLabel) = \"en\" && LANG(?countryLabel) = \"en\").\n",
    "    }}\n",
    "    \"\"\"\n",
    "        \n",
    "    sparql_wdata = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "\n",
    "    sparql_wdata.setQuery(query_wikidata_countries)\n",
    "\n",
    "    sparql_wdata.setReturnFormat(JSON)\n",
    "\n",
    "    results = sparql_wdata.query().convert()\n",
    "\n",
    "    return results[\"results\"][\"bindings\"][0][\"country\"][\"value\"]\n",
    "\n",
    "results = query_graphDB()\n",
    "matches= []\n",
    "for c in results[\"results\"][\"bindings\"]:\n",
    "    label = c[\"cityName\"][\"value\"]\n",
    "    # if label != \"Montreal\":\n",
    "    #     continue\n",
    "    longitude = float(c[\"longitude\"][\"value\"])\n",
    "    latitude = float(c[\"latitude\"][\"value\"])\n",
    "    print(label, longitude, latitude)\n",
    "    wdata = query_wikidata_coordinates(latitude, longitude, label)\n",
    "    result_dbpedia = (c,query_dbpedia_coordinates(latitude, longitude, label))\n",
    "    result_wdata_countries= query_wikidata_countries(wdata)\n",
    "    result_wikidata = (c,wdata)\n",
    "    matches.append(result_dbpedia)\n",
    "    matches.append(result_wikidata)\n",
    "    matches.append(result_wdata_countries)\n",
    "# matches"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "# matches[0][0][\"City\"][\"value\"], matches[0][1][\"city\"][\"value\"]\n",
    "\n",
    "# s = \"<\"+matches[0][0][\"City\"][\"value\"] +\"> \" + \"<http://www.w3.org/2002/07/owl#sameAs> \" + \"<\"+matches[0][1][\"city\"][\"value\"] +\"> .\"\n",
    "triples = []\n",
    "for m in matches:\n",
    "    s = \"<\"+m[0][\"City\"][\"value\"] +\"> \" + \"<http://www.w3.org/2002/07/owl#sameAs> \" + \"<\"+m[1][\"city\"][\"value\"] +\"> .\\n\"\n",
    "    triples.append(s)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(\"matches.nt\", \"w\") as f:\n",
    "    f.writelines(triples)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# DBPedia"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'link': [], 'vars': ['city', 'cityLabel', 'lat', 'long']},\n",
       " 'results': {'distinct': False,\n",
       "  'ordered': True,\n",
       "  'bindings': [{'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Carignan,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Carignan, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.45'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.3'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Rosemre'},\n",
       "    'cityLabel': {'type': 'literal', 'xml:lang': 'en', 'value': 'Rosemre'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.6369'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.8'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Beaconsfield,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Beaconsfield, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4333'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.8667'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Beauharnois,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Beauharnois, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.3247'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.8531'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Beloeil,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Beloeil, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.5667'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.2'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Bois-des-Filion'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Bois-des-Filion'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.6667'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.75'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Boucherville'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Boucherville'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.6'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.45'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Delson'},\n",
       "    'cityLabel': {'type': 'literal', 'xml:lang': 'en', 'value': 'Delson'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4017'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.5364'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Deux-Montagnes'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Deux-Montagnes'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.5333'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.8833'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Hudson,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Hudson, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.45'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-74.15'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Repentigny,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Repentigny, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.7333'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.4667'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Richelieu,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Richelieu, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.45'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.25'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Varennes,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Varennes, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.6833'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.4333'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Vaudreuil-Dorion'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Vaudreuil-Dorion'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-74.0333'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Contrecur,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Contrecur, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.85'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.2333'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Mascouche'},\n",
       "    'cityLabel': {'type': 'literal', 'xml:lang': 'en', 'value': 'Mascouche'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.75'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.6'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Saint-Amable'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Saint-Amable'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.65'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.3'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Saint-Bruno-de-Montarville'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Saint-Bruno-de-Montarville'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.5333'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.35'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Saint-Csaire,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Saint-Csaire, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4167'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.0'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Saint-Eustache,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Saint-Eustache, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.57'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.9'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Saint-Hyacinthe'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Saint-Hyacinthe'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.6167'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-72.95'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Saint-Jean-sur-Richelieu'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Saint-Jean-sur-Richelieu'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.3167'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.2667'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Saint-Jrme'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Saint-Jrme'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.7833'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-74.0'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Saint-Lambert,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Saint-Lambert, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.5'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.5167'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Saint-LinLaurentides'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Saint-LinLaurentides'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.85'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.7667'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Saint-Rmi,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Saint-Rmi, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.2667'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.6167'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Sainte-Anne-de-Bellevue'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Sainte-Anne-de-Bellevue'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4039'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.9525'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Sainte-Anne-des-Plaines'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Sainte-Anne-des-Plaines'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.7667'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.8167'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Geography_of_Montreal'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Geography of Montreal'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.5'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.5833'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Mirabel,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Mirabel, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.6636'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-74.0019'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Mont-Saint-Hilaire'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Mont-Saint-Hilaire'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.5622'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.1917'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Montreal'},\n",
       "    'cityLabel': {'type': 'literal', 'xml:lang': 'en', 'value': 'Montreal'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.5089'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.5542'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Montreal_West,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Montreal West, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4536'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.6472'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Longueuil'},\n",
       "    'cityLabel': {'type': 'literal', 'xml:lang': 'en', 'value': 'Longueuil'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.5333'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.5167'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Lorraine,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Lorraine, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.6833'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.7833'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Brossard'},\n",
       "    'cityLabel': {'type': 'literal', 'xml:lang': 'en', 'value': 'Brossard'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4667'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.45'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Westmount,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Westmount, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4833'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.6'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Cte_Saint-Luc'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Cte Saint-Luc'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4667'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.6667'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': \"http://dbpedia.org/resource/Notre-Dame-de-l'le-Perrot\"},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': \"Notre-Dame-de-l'le-Perrot\"},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.3667'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.9333'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Otterburn_Park'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Otterburn Park'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.5333'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.2167'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Greenfield_Park,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Greenfield Park, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.492'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.487'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Hampstead,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Hampstead, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4833'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.6333'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Terrebonne,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Terrebonne, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.7'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.6333'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Chambly,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Chambly, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.45'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.2833'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Charlemagne,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Charlemagne, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.7167'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.4833'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Chomedey,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Chomedey, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.55'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.7333'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': \"http://dbpedia.org/resource/L'Assomption,_Quebec\"},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': \"L'Assomption, Quebec\"},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.8333'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.4167'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': \"http://dbpedia.org/resource/L'piphanie,_Quebec_(town)\"},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': \"L'piphanie, Quebec (town)\"},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.85'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.4833'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': \"http://dbpedia.org/resource/L'le-Bizard,_Quebec\"},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': \"L'le-Bizard, Quebec\"},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4874'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.8799'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': \"http://dbpedia.org/resource/L'le-Cadieux\"},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': \"L'le-Cadieux\"},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4333'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-74.0167'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': \"http://dbpedia.org/resource/L'le-Dorval\"},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': \"L'le-Dorval\"},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4322'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.7414'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': \"http://dbpedia.org/resource/L'le-Perrot,_Quebec\"},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': \"L'le-Perrot, Quebec\"},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.3833'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.95'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Laval,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Laval, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.5833'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.75'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Laval-Ouest'},\n",
       "    'cityLabel': {'type': 'literal', 'xml:lang': 'en', 'value': 'Laval-Ouest'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.55'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.8667'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Lavaltrie'},\n",
       "    'cityLabel': {'type': 'literal', 'xml:lang': 'en', 'value': 'Lavaltrie'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.8833'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.2833'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Dollard-des-Ormeaux'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Dollard-des-Ormeaux'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4833'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.8167'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Dorval'},\n",
       "    'cityLabel': {'type': 'literal', 'xml:lang': 'en', 'value': 'Dorval'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.45'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.75'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Marieville,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Marieville, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4333'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.1667'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Pierrefonds,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Pierrefonds, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.4667'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.8833'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Pincourt'},\n",
       "    'cityLabel': {'type': 'literal', 'xml:lang': 'en', 'value': 'Pincourt'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.3833'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.9833'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Place_milie-Gamelin'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Place milie-Gamelin'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.5154'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.56'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Pointe-Claire'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Pointe-Claire'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.45'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.8167'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://dbpedia.org/resource/Iberville,_Quebec'},\n",
       "    'cityLabel': {'type': 'literal',\n",
       "     'xml:lang': 'en',\n",
       "     'value': 'Iberville, Quebec'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '45.3167'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#float',\n",
       "     'value': '-73.2333'}}]}}"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "latitude = 45.5128\n",
    "longitude = -73.56\n",
    "def query_dbpedia_coordinates(latitude, longitude):\n",
    "    query = f\"\"\"\n",
    "    PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "    PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "\n",
    "    SELECT DISTINCT ?city ?cityLabel  ?lat ?long\n",
    "    WHERE {{\n",
    "      ?city a dbo:City .\n",
    "      ?city rdfs:label ?cityLabel .\n",
    "      ?city geo:lat ?lat .\n",
    "      ?city geo:long ?long .\n",
    "      FILTER (LANG(?cityLabel) = \"en\")\n",
    "      FILTER (\n",
    "        bif:st_intersects (\n",
    "          bif:st_point (?long, ?lat),\n",
    "          bif:st_point ({longitude}, {latitude}),\n",
    "          50\n",
    "        )\n",
    "      )\n",
    "    }}\n",
    "    LIMIT 1000\n",
    "\n",
    "\n",
    "    \"\"\"\n",
    "\n",
    "    sparql_dbpedia = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "\n",
    "    sparql_dbpedia.setQuery(query)\n",
    "\n",
    "    sparql_dbpedia.setReturnFormat(JSON)\n",
    "\n",
    "    results = sparql_dbpedia.query().convert()\n",
    "    return results\n",
    "\n",
    "\n",
    "results = query_dbpedia_coordinates(latitude, longitude)\n",
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "results = query_graphDB()\n",
    "matches= []\n",
    "for c in results[\"results\"][\"bindings\"]:\n",
    "    label = c[\"cityName\"][\"value\"]\n",
    "    longitude = float(c[\"longitude\"][\"value\"])\n",
    "    latitude = float(c[\"latitude\"][\"value\"])\n",
    "    print(label, longitude, latitude)\n",
    "    result_wikidata = (c,query_dbpedia_coordinates(latitude, longitude, label, data=data[label]))\n",
    "    matches.append(result_wikidata)\n",
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Carignan, Quebec'"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results[\"results\"][\"bindings\"][0][\"cityLabel\"][\"value\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Linked geodata"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'link': [], 'vars': ['city', 'cityLabel', 'lat', 'long']},\n",
       " 'results': {'distinct': False,\n",
       "  'ordered': True,\n",
       "  'bindings': [{'city': {'type': 'uri',\n",
       "     'value': 'http://linkedgeodata.org/triplify/node299790200'},\n",
       "    'cityLabel': {'type': 'literal', 'xml:lang': 'en', 'value': 'Montreal'},\n",
       "    'lat': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'value': '45.5088'},\n",
       "    'long': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#double',\n",
       "     'value': '-73.554'}}]}}"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# montreal cooridinates\n",
    "latitude = 45.5128\n",
    "longitude = -73.56\n",
    "\n",
    "query = f\"\"\"\n",
    "PREFIX lgdo: <http://linkedgeodata.org/ontology/>\n",
    "PREFIX geom: <http://geovocab.org/geometry#>\n",
    "PREFIX ogc: <http://www.opengis.net/ont/geosparql#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "\n",
    "SELECT DISTINCT ?city ?cityLabel ?lat ?long\n",
    "WHERE {{\n",
    "  ?city a lgdo:City ;\n",
    "        rdfs:label ?cityLabel ;\n",
    "        geo:lat ?lat ;\n",
    "        geo:long ?long .\n",
    "  FILTER (LANG(?cityLabel) = \"en\")\n",
    "  FILTER (\n",
    "    bif:st_intersects (\n",
    "      bif:st_point(?long, ?lat),\n",
    "      bif:st_point({longitude}, {latitude}),\n",
    "      50\n",
    "    )\n",
    "  )\n",
    "}}\n",
    "LIMIT 1000\n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sparql_linkedgeodata = SPARQLWrapper(\"http://linkedgeodata.org/sparql\")\n",
    "sparql_linkedgeodata.setQuery(query)\n",
    "sparql_linkedgeodata.setReturnFormat(JSON)\n",
    "results = sparql_linkedgeodata.query().convert()\n",
    "\n",
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['city', 'cityLabel', 'country', 'countryLabel']},\n",
       " 'results': {'bindings': [{'country': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q77'},\n",
       "    'countryLabel': {'xml:lang': 'en', 'type': 'literal', 'value': 'Uruguay'},\n",
       "    'cityLabel': {'xml:lang': 'en',\n",
       "     'type': 'literal',\n",
       "     'value': 'Montevideo'}}]}}"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['city']},\n",
       " 'results': {'bindings': [{'city': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q84'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q271730'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q340'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q17645993'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q100'}},\n",
       "   {'city': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q23436'}},\n",
       "   {'city': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q1335'}}]}}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graphDB_query = \"\"\"\n",
    "PREFIX voc: <http://vocabulary.example.org/>\n",
    "PREFIX saref: <https://saref.etsi.org/core/>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX schema: <https://schema.org/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "\n",
    "SELECT ?city WHERE {\n",
    "  ?city rdf:type schema:City .\n",
    "  FILTER(STRSTARTS(STR(?city), \"http://www.wikidata.org/entity/\"))\n",
    "} \n",
    "\"\"\"\n",
    "sparql_graphdb = SPARQLWrapper(\"http://193.2.205.14:7200/repositories/EnergyGraph_mixed\")\n",
    "sparql_graphdb.setQuery(graphDB_query)\n",
    "sparql_graphdb.setReturnFormat(JSON)\n",
    "results = sparql_graphdb.query().convert()\n",
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q84\n",
      "Q271730\n",
      "Q340\n",
      "Q17645993\n",
      "Q100\n",
      "Q23436\n",
      "Q1335\n"
     ]
    }
   ],
   "source": [
    "for r in results[\"results\"][\"bindings\"]:\n",
    "    print(r[\"city\"][\"value\"].split(\"/\")[-1])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['city', 'cityLabel', 'country', 'countryLabel']},\n",
       " 'results': {'bindings': [{'country': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q77'},\n",
       "    'countryLabel': {'xml:lang': 'en', 'type': 'literal', 'value': 'Uruguay'},\n",
       "    'cityLabel': {'xml:lang': 'en',\n",
       "     'type': 'literal',\n",
       "     'value': 'Montevideo'}}]}}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "country_id = \"Q1335\"\n",
    "query_wikidata_countries =f\"\"\"PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX bd: <http://www.bigdata.com/rdf#>\n",
    "\n",
    "SELECT ?city ?cityLabel ?country ?countryLabel\n",
    "WHERE {{\n",
    "  wd:{country_id} rdfs:label ?cityLabel ;  # City (Montreal)\n",
    "          wdt:P17 ?country .         # Country of the city\n",
    "  ?country rdfs:label ?countryLabel .\n",
    "  \n",
    "  FILTER(LANG(?cityLabel) = \"en\" && LANG(?countryLabel) = \"en\").\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "sparql_wdata = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "\n",
    "sparql_wdata.setQuery(query)\n",
    "\n",
    "sparql_wdata.setReturnFormat(JSON)\n",
    "\n",
    "results = sparql_wdata.query().convert()\n",
    "\n",
    "results\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'http://www.wikidata.org/entity/Q77'"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results[\"results\"][\"bindings\"][0][\"country\"][\"value\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
